In [1]:
import pandas as pd

In [2]:
data = {
    'Name': ['Aman', 'Reena', 'Raj', 'Pooja'],
    'Age': [25, 35, 45, 28],
    'Salary': [30000, 60000, 80000, 40000]
}
df = pd.DataFrame(data)
df

    Name  Age  Salary
0   Aman   25   30000
1  Reena   35   60000
2    Raj   45   80000
3  Pooja   28   40000

In [3]:
df[df['Age']>30]

    Name  Age  Salary
1  Reena   35   60000
2    Raj   45   80000

In [11]:
#Logical operator

# logiacal and -> &
# logical or  -> |
# logical not  -> ~

df[(df['Age']==25) & (df['Salary']==30000)]

   Name  Age  Salary
0  Aman   25   30000

In [10]:
df[ (df['Age']==25) |  (df['Age']==35)]

    Name  Age  Salary
0   Aman   25   30000
1  Reena   35   60000

In [12]:
df[~(df['Age']==25)]

    Name  Age  Salary
1  Reena   35   60000
2    Raj   45   80000
3  Pooja   28   40000

In [14]:
## 3. Filtering using isin() 
#Filter rows where Name is either Raj or Reena

df[df['Name'].isin(['Raj','Pooja'])]

    Name  Age  Salary
2    Raj   45   80000
3  Pooja   28   40000

In [20]:
df[df['Name'].isin(['Raj','Pooja'])]['Name']

2      Raj
3    Pooja
Name: Name, dtype: object

In [21]:
#4. Filtering using between()
#Use between(start, end) to filter rows within a range (inclusive).
# Age between 30 and 40
print(df[df['Age'].between(30, 40)])

    Name  Age  Salary
1  Reena   35   60000

In [22]:
# 5. Filtering using .query()
# .query() allows us to write SQL-like queries for filtering â€” clean and readable.
#  Use query to filter Age > 30 and Salary < 70000

print(df.query('Age > 30 and Salary < 70000'))

    Name  Age  Salary
1  Reena   35   60000

In [23]:
df

    Name  Age  Salary
0   Aman   25   30000
1  Reena   35   60000
2    Raj   45   80000
3  Pooja   28   40000

In [24]:
df2=df.set_index('Name')
df2

       Age  Salary
Name
Aman    25   30000
Reena   35   60000
Raj     45   80000
Pooja   28   40000

In [27]:
df2.loc['Aman']

Age          25
Salary    30000
Name: Aman, dtype: int64

In [28]:
df3=df2.reset_index()
df3

    Name  Age  Salary
0   Aman   25   30000
1  Reena   35   60000
2    Raj   45   80000
3  Pooja   28   40000